Revit 2027 API
Document.NewSlabEdge Method
Creates a slab edge.
Overload List
Name | Description
NewSlabEdge(SlabEdgeType, Reference) | Creates a slab edge along a reference.
NewSlabEdge(SlabEdgeType, ReferenceArray) | Creates a slab edge along a reference array.
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace